       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGABEND.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           EXEC CICS ABEND
           END-EXEC.
           EXEC CICS RETURN END-EXEC.