//HELLO  EXEC PGM=IEBGENER                 
/*                                         
//SYSUT1 DD *                              
++MESSAGE++
//*                                        
//SYSUT2 DD SYSOUT=A                       
//SYSPRINT DD SYSOUT=A                     
//SYSIN    DD DUMMY                        
//              