//TEST     EXEC PGM=IDCAMS                      
//SYSPRINT DD  SYSOUT=*                         
//SYSIN    DD  *                                
  LISTCAT ENTRIES('++DATASET++')     
/*                                              