//TEST     EXEC PGM=IDCAMS                      
//SYSPRINT DD  SYSOUT=*                         
//SYSIN    DD  *                                
     DELETE -
            ('++DATASET++')     
/*                                              