//MYLIB    JCLLIB ORDER=(CICS.INSTALL.SDFHPROC)
//SDVCAPTR EXEC DFHXSDSO,
//      HLQ=CICS.INSTALL,
//      LOGSTRM=owner1.APPL1.DFHSECR,
//      CYL=100
//EXTRACT.SYSIN DD *
HEADER=NO