//MYLIB    JCLLIB ORDER=(CICS.INSTALL.SDFHPROC)
//SDVCAPTR EXEC DFHXSDSO,
//      HLQ=CICS.INSTALL,
//      LOGSTRM=owner1.APPL1.DFHSECR,
//      CYL=100
//EXTRACT.SYSIN DD *
HEADER=NO
MATCHID=_654654
USERID=user1,ROLE=TELLER
MATCHID=_7676575
USERID=user2,ROLE=ADMIN
/*
//