//*---------------------------------------------------------------------
//*
//* C/++TYPE++ COMPILE/LINK ++PROGRAM++
//*
//*---------------------------------------------------------------------
//C       EXEC PGM=CCNDRVR,REGION=0M,
// PARM=++C.PARM++
//STEPLIB  DD ++C.STEPLIB++
//SYSLIB   DD ++C.SYSLIB++
//SYSUT5   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT6   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT7   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT8   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT9   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT10  DD SYSOUT=*
//SYSUT14  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT16  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT17  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSCPRT  DD SYSOUT=*
//SYSIN    DD DATA,DLM='++'
++SOURCE++
++
//SYSLIN   DD DISP=(MOD,PASS),DSN=&&SYSLIN,
//            UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1),
//            RECFM=FB,LRECL=80,BLKSIZE=3200
//*---------------------------------------------------------------------
//CHECK001 IF RC LE 4 THEN
//LKED     EXEC PGM=IEWL,REGION=0M,
// PARM=++LKED.PARM++
//SYSLIB   DD ++LKED.SYSLIB++
//SYSLIN   DD ++LKED.SYSIN++ 
//SYSUT1   DD UNIT=SYSALLDA,BLKSIZE=1024,                  
//            SPACE=(1024,(200,20))
//SYSPRINT DD SYSOUT=*
//SYSLMOD  DD DISP=SHR,DSN=++SYSLMOD++(++PROGRAM++)
//CHECK001 ENDIF
//