//*---------------------------------------------------------------------
//*
//* COBOL/++TYPE++ COMPILE/LINK ++PROGRAM++
//*
//*---------------------------------------------------------------------
//COBOL    EXEC PGM=IGYCRCTL,REGION=0M,
// PARM=++COBOL.PARM++
//STEPLIB  DD ++COBOL.STEPLIB++
//SYSLIB   DD ++COBOL.SYSLIB++
//SYSUT1   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT2   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT3   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT4   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT5   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT6   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT7   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT8   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT9   DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT10  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT11  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT12  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT13  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT14  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSUT15  DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSMDECK DD UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DATA,DLM='++'
++SOURCE++
++
//SYSLIN   DD DISP=(MOD,PASS),DSN=&&SYSLIN,
//            UNIT=SYSALLDA,SPACE=(CYL,(1,1)),VOL=(,,,1)
//*---------------------------------------------------------------------
//CHECK001 IF RC LE 4 THEN
//LKED     EXEC PGM=IEWL,REGION=0M,
// PARM=++LKED.PARM++
//SYSLIB   DD ++LKED.SYSLIB++
//SYSLIN   DD ++LKED.SYSIN++ 
//SYSUT1   DD UNIT=SYSALLDA,BLKSIZE=1024,                  
//            SPACE=(1024,(200,20))
//SYSPRINT DD SYSOUT=*
//SYSLMOD  DD DISP=SHR,DSN=++SYSLMOD++(++PROGRAM++)
//CHECK001 ENDIF
//