//LIST    EXEC PGM=IEBGENER                         
//SYSPRINT DD  SYSOUT=*                             
//SYSUT1   DD  DISP=SHR,DSN=++MEMBER_NAME++    
//SYSUT2   DD  SYSOUT=*                             
//SYSIN    DD  DUMMY                                
/*                                                  