//MYLIB    JCLLIB ORDER=(++CICSHLQ++.SDFHPROC)
//SDVCAPTR EXEC DFHXSDSO,
//      HLQ=++CICSHLQ++,
//      LOGSTRM=++OWNER++.++APPLID++.DFHSECR,
//      CYL=100
//EXTRACT.SYSIN DD *
HEADER=NO